app/serializers/concerns/appliances_records_mutual_fields.rb

SELECT  "appliances".* FROM "appliances" WHERE "appliances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def location
    Location.find_by(id: object.appliance.location_id).name