app/serializers/concerns/appliances_mutual_fields.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def location
    Location.find_by(id: object.location_id).name