app/serializers/location_serializer.rb

  def active_devices
    object.appliance.count
---
SELECT COUNT(*) FROM "appliances" WHERE "appliances"."location_id" = ?  [["location_id", 1]]