app/controllers/air_quality_machines_controller.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_location
    @location = Location.find(params[:location_id])