app/controllers/locations_controller.rb

  def create
    @location = Location.create! locations_parameters
---
INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "3.19"], ["created_at", "2018-11-19 14:35:29.689104"], ["updated_at", "2018-11-19 14:35:29.689104"]]

  def update
    @location.update locations_parameters
---
UPDATE "locations" SET "name" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["name", "3.20"], ["updated_at", "2018-11-19 14:36:29.954458"], ["id", 2]]