app/controllers/ssshh_o_matics_controller.rb

  def set_location
    @location = Location.find(params[:location_id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]